app/Modules/MobileApp/Controllers/Auth.php

SELECT *
FROM `tbl_users`
WHERE `email` = 'mayowa.steepe@gmail.com'
 LIMIT 1
UPDATE `tbl_users` SET `last_login_at` = '2025-11-12 09:07:02', `updated_at` = '2025-11-12 09:07:02'
WHERE `tbl_users`.`id` IN ('2')
---
    public function attemptLogin()
    {
        $email = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        if (empty($email) || empty($password)) {
            return redirect()->back()->with('error', 'Email and password are required.')->withInput();
        }

        $model = new UserModel();
        $user = $model->where('email', $email)->first();

        if (!$user) {
            return redirect()->back()->with('error', 'No account found for that email.')->withInput();
        }

        if (!password_verify($password, $user['password'])) {
            return redirect()->back()->with('error', 'Invalid password.')->withInput();
        }

        // Store login session
        session()->set([
            'user_id'     => $user['id'],
            'user_email'  => $user['email'],
            'user_role'   => $user['role'],
            'uuid'        => $user['uuid'],
            'isLoggedIn'  => true,
        ]);

        // Update last login timestamp
        $model->update($user['id'], ['last_login_at' => date('Y-m-d H:i:s')]);