app/Modules/MobileApp/Controllers/ExhibitorsController.php

    public function index()
    {
        $model = new ExhibitorModel();
        $exhibitors = $model->orderBy('company_name', 'ASC')->findAll();
---
SELECT *
FROM `tbl_exhibitors`
ORDER BY `company_name` ASC