app/Modules/MobileApp/Controllers/Home.php

SELECT *
FROM `tbl_conferences`
WHERE `status` IN ('live','past')
ORDER BY `year` DESC
---
    public function index(): string|\CodeIgniter\HTTP\RedirectResponse
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(site_url('mobile/login'));
        }

        $conferenceModel = new ConferenceModel();

        $conferences = $conferenceModel
            ->whereIn('status', ['live', 'past'])
            ->orderBy('year', 'DESC')
            ->findAll();