app/Modules/MobileApp/Controllers/RegisterController.php

SELECT *
FROM `tbl_countries`
ORDER BY `country_name` ASC
---
    public function index()
    {
        $countryModel = new CountryModel();
        $data['countries'] = $countryModel->orderBy('country_name', 'ASC')->findAll();