app/Modules/Api/Controllers/ConferenceController.php

    public function live()
    {
        $model = new TblConferencesModel();

        // ✅ Use the correct column name
        $conference = $model->where('status', 'live')->first();
---
SELECT *
FROM `tbl_conferences`
WHERE `status` = 'live'
 LIMIT 1