app/Modules/Api/Controllers/PaymentsController.php

SELECT *
FROM `tbl_attendee_payments`
WHERE `attendee_id` = '2'
AND `conference_id` = 1
ORDER BY `paymentdate` DESC
 LIMIT 1
---
    public function check($attendee_id = null)
    {
        if (!$attendee_id) {
            return $this->failValidationErrors('Missing attendee ID.');
        }

        $conferenceId = $this->request->getGet('conference_id') ?? 1; // Default or pass as ?conference_id=

        $paymentModel = new TblAttendeePaymentsModel();

        $payment = $paymentModel
            ->where('attendee_id', $attendee_id)
            ->where('conference_id', $conferenceId)
            ->orderBy('paymentdate', 'DESC')
            ->first();