app/Modules/Api/Controllers/RegistrationController.php

    public function register()
    {
        $data = $this->request->getJSON(true);

        if (empty($data['firstname']) || empty($data['lastname']) || empty($data['email']) || empty($data['password'])) {
            return $this->failValidationErrors('Missing required fields.');
        }

        if ($this->users->where('email', $data['email'])->first()) {
            return $this->failResourceExists('Email already registered.');
        }

        $uuid           = Uuid::uuid4()->toString();
        $hashedPassword = password_hash($data['password'], PASSWORD_BCRYPT);
        $ipAddress      = $this->request->getIPAddress();

        $userData = [
            'uuid'        => $uuid,
            'email'       => $data['email'],
            'password'    => $hashedPassword,
            'role'        => 'attendee',
            'is_verified' => 1,
            'created_at'  => date('Y-m-d H:i:s'),
            'updated_at'  => date('Y-m-d H:i:s'),
        ];

        $userId = $this->users->insert($userData);
---
SELECT *
FROM `tbl_users`
WHERE `email` = 'steepe@live.comss'
AND `tbl_users`.`deleted_at` IS NULL
 LIMIT 1
INSERT INTO `tbl_users` (`uuid`, `email`, `password`, `role`, `is_verified`, `created_at`, `updated_at`) VALUES ('7d9dc31c-631d-479c-9efb-a5b3840a466f', 'steepe@live.comss', '$2y$12$iyHl49/k58t3gKqdSAYIGe5mI0agiLi2wzzSzDH6gjLRvSBaWO6GK', 'attendee', 1, '2025-11-12 12:12:32', '2025-11-12 12:12:32')

        ];

        try {
            $this->attendees->insert($attendeeData);
---
INSERT INTO `tbl_attendees` (`attendee_id`, `firstname`, `lastname`, `telephone`, `country`, `city`, `state`, `useremail`, `userpassword`, `ipaddress`, `uid`, `is_verified`, `registration_timestamp`) VALUES (2048, 'Oluwamayowa', 'Steepe', '08033868618', 'Antigua and Barbuda', 'Lekki', 'Lagos', 'steepe@live.comss', '$2y$12$iyHl49/k58t3gKqdSAYIGe5mI0agiLi2wzzSzDH6gjLRvSBaWO6GK', '127.0.0.1', 'a1d9a282948', 1, '2025-11-12 12:12:32')