app/Modules/MobileApp/Models/SpeakersModel.php

    public function getAllSpeakers()
    {
        $builder = $this->builder();
        $builder->orderBy('speaker_name', 'ASC');
        $speakers = $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_speakers`
ORDER BY `speaker_name` ASC

    protected function getSpeakerSessions($speakerId)
    {
        $db = \Config\Database::connect();
        return $db->table('tbl_session_speakers as ss')
            ->select('s.sessions_id, s.sessions_name')
            ->join('tbl_conference_sessions as s', 's.sessions_id = ss.sessions_id', 'left')
            ->where('ss.speaker_id', $speakerId)
            ->get()
            ->getResultArray();
---
SELECT `s`.`sessions_id`, `s`.`sessions_name`
FROM `tbl_session_speakers` as `ss`
LEFT JOIN `tbl_conference_sessions` as `s` ON `s`.`sessions_id` = `ss`.`sessions_id`
WHERE `ss`.`speaker_id` = '1'