app/Modules/MobileApp/Models/SponsorModel.php

SELECT *
FROM `tbl_sponsors`
ORDER BY `is_featured` DESC, CASE
            WHEN tier = 'Diamond' THEN 1
            WHEN tier = 'Platinum' THEN 2
            WHEN tier = 'Distruptor' THEN 3
            ELSE 4 END ASC, `name` ASC
---
    public function getAllSponsors()
    {
        $orderCase = "CASE
            WHEN tier = 'Diamond' THEN 1
            WHEN tier = 'Platinum' THEN 2
            WHEN tier = 'Distruptor' THEN 3
            ELSE 4 END";

        return $this->orderBy('is_featured', 'DESC')
            ->orderBy($orderCase, 'ASC')
            ->orderBy('name', 'ASC')
            ->findAll();